[
	"I always told everybody the perfect joke would be where the setup and punch line were identical",
	"Comedy is surprises, so if you're intending to make somebody laugh and they don't laugh, that's funny.",
	"In math, you could get 100 percent. It was very fair. That's what I liked about math. You could figure it out, and the teacher couldn't have a stupid opinion about it.",
	"I'm not gay, so I don't know much about Broadway musicals.",
	"You know, with Hitler, the more I learn about that guy, the more I don’t care for him.",
	"I don’t care for sex. I find it an embarrassing, dull exercise. I prefer sports, where you can win.",
	"All my life’s about is cracking up people and them cracking me up and trying not to think about dying. That doesn’t cost very much money.",
	"It’s a very odd thing with Hollywood, where you do stand-up, you’re good at it, then they go, ‘How would you like to be a horrible actor?’ Then you say, All right, that sounds good. I’ll do that.",
	"There are two things which a man should scrupulously avoid: giving advice that he would not follow, and asking advice when he is determined to pursue his own opinion.",
	"OJ Simpson was in a different kind of courtroom this week attempting to regain custody of his two children. In order to prove to the court how much he loves his kids, OJ pointed out quote ‘Hey, they’re still alive, aren’t they?’",
	"Note to self: no matter how bad life gets, there’s always beer.",
	"He has the disease of alcoholism. And he came to me... and he told me, and I’m the kind of guy that likes to look at the bright side of things. So I told him, I said, ‘Richie, it’s true that you have a disease and everything, but I think you got the best one.’",
	"I saw this one - it was for cat food - at the end of it, it says, ‘All natural food for your cat.’ All natural food? But cat food’s made out of horse meat. Yeah, that’s the way it works in nature: the cat, right above the horse in the food chain.",
	"When I hear a guy lost a battle to cancer, that really did bother me, that that’s a term. It implies that he failed and that somebody else that defeated cancer is heroic and courageous.",
	"I never do impressions, but I probably should. People like that stuff.",
	"I love writing - it's the best. But I really hate collaboration.",
	"I don't know the difference between a hippie and a hipster but, it's fun to watch either one of them get beat up.",
	"Love is an artful arrangement of artless pretensions, whereby we labor to appear innocent in what we desire to be most cunning.",
	"During misfortunes, nothing aggravates our condition more, than to be esteemed deserving of them.",
	"Chastity is oftener owing to diffidence and shame, than to fortitude of reason or virtue.",
	"As long as the red dice are in the air, the gambler has hope. And hope is a wonderful thing to be addicted to.",
	"I'll admit that I'm deeply closeted, but I'll never admit that I'm gay.",
	"The only time having a cult following is a great thing is when you are actually in a cult.",
	"I hate when people say “touché” after you say something funny. I don’t know what it means, but I know that I hate it.",
	"As Adolf Hitler once said, all publicity is good publicity.",
	"With the computer and stuff, the difference between a rich guy and a poor guy, to me, is nothing. Because I don’t like big houses, I don’t drive a car, so you know, I just live in a small apartment and I have my computer, which is really cool.",
	"Stand-up has the best writers because it’s the hardest writing by a million miles.",
	"If you’re watching a comedian on television and he’s making a political point, I would say he’s gotten too serious.",
	"Many people are skeptical about marriage of Michael Jackson and Lisa Marie Pressley. They say, Lisa Marie is more of a sit at home type, while Michael Jackson is more of a homosexual pedophile.",
	"You ever lie for no reason at all? Just all of sudden, a big lie spills out of your evil head. Like a guy will come up to you, 'Hey, did you ever see that movie with Meryl Streep and a horse?' And you go, 'Yes.' In the back of your head, you're like, 'What in the hell am I lying about over here? I stand to gain nothing by this lie.'",
	"They say that if you're afraid of homosexuals, it means that deep down inside you're actually a homosexual yourself. That worries me because I'm afraid of dogs.",
	"I just got back from New York. You ever been there? There was a big gay parade going on there when I was there, and I never been to one of them, and I like a parade. I always like a parade. So, I go there, and it turns out, it's just a bunch of gay guys.",
	"I'm thankful for women. I think women are more intelligent than men. Also, without women, there would be no cookies.",
	"It is often better to be restricted to necessity than unconfined in the measure of our desires: prosperity destroys more individuals than adversity ruins.",
	"Instead of loving your enemies, have no enemies to love.",
	"Then he unsmiled his lips and got real plural on me. “We’ll let you know.",
	"and I always considered Elton John to be a great singer as well as a hot piece of ass.",
	"When it's unexpected, death comes fast like a ravenous wolf and tears open your throat with a merciful fury. But when it's expected, it comes slow and patient like a snake, and the doctor tells you how far away it is and when, exactly it will be at your door. And when it will be at the foot of your bed. And when it will be on your flesh. It's all right there on the clipboards."
]