[
	"I always told everybody the perfect joke would be where the setup and punch line were identical",
	"Comedy is surprises, so if you're intending to make somebody laugh and they don't laugh, that's funny.",
	"In math, you could get 100 percent. It was very fair. That's what I liked about math. You could figure it out, and the teacher couldn't have a stupid opinion about it.",
	"I'm not gay, so I don't know much about Broadway musicals.",
	"You know, with Hitler, the more I learn about that guy, the more I don’t care for him.",
	"I don’t care for sex. I find it an embarrassing, dull exercise. I prefer sports, where you can win.",
	"All my life’s about is cracking up people and them cracking me up and trying not to think about dying. That doesn’t cost very much money.",
	"It’s a very odd thing with Hollywood, where you do stand-up, you’re good at it, then they go, ‘How would you like to be a horrible actor?’ Then you say, All right, that sounds good. I’ll do that.",
	"There are two things which a man should scrupulously avoid: giving advice that he would not follow, and asking advice when he is determined to pursue his own opinion.",
	"OJ Simpson was in a different kind of courtroom this week attempting to regain custody of his two children. In order to prove to the court how much he loves his kids, OJ pointed out quote ‘Hey, they’re still alive, aren’t they?’",
	"Note to self: no matter how bad life gets, there’s always beer.",
	"He has the disease of alcoholism. And he came to me... and he told me, and I’m the kind of guy that likes to look at the bright side of things. So I told him, I said, ‘Richie, it’s true that you have a disease and everything, but I think you got the best one.’",
	"I saw this one - it was for cat food - at the end of it, it says, ‘All natural food for your cat.’ All natural food? But cat food’s made out of horse meat. Yeah, that’s the way it works in nature: the cat, right above the horse in the food chain.",
	"When I hear a guy lost a battle to cancer, that really did bother me, that that’s a term. It implies that he failed and that somebody else that defeated cancer is heroic and courageous.",
	"I never do impressions, but I probably should. People like that stuff.",
	"I love writing - it's the best. But I really hate collaboration."
]